[
  {
    "type": "integer",
    "name": "person_id",
    "mode": "required",
    "description": "A unique identifier for each person."
  },
  {
    "type": "integer",
    "name": "gender_concept_id",
    "mode": "required",
    "description": "A foreign key that refers to an identifier in the CONCEPT table for the unique gender of the person."
  },
  {
    "type": "integer",
    "name": "year_of_birth",
    "mode": "required",
    "description": "The year of birth of the person. For data sources with date of birth, the year is extracted. For data sources where the year of birth is not available, the approximate year of birth is derived based on any age group categorization available."
  },
  {
    "type": "integer",
    "name": "month_of_birth",
    "mode": "nullable",
    "description": "The month of birth of the person. For data sources that provide the precise date of birth, the month is extracted and stored in this field."
  },
  {
    "type": "integer",
    "name": "day_of_birth",
    "mode": "nullable",
    "description": "The day of the month of birth of the person. For data sources that provide the precise date of birth, the day is extracted and stored in this field."
  },
  {
    "type": "timestamp",
    "name": "birth_datetime",
    "mode": "nullable",
    "description": "The date and time of birth of the person."
  },
  {
    "type": "integer",
    "name": "race_concept_id",
    "mode": "required",
    "description": "A foreign key that refers to an identifier in the CONCEPT table for the unique race of the person."
  },
  {
    "type": "integer",
    "name": "ethnicity_concept_id",
    "mode": "required",
    "description": "A foreign key that refers to the standard concept identifier in the Standardized Vocabularies for the ethnicity of the person."
  },
  {
    "type": "integer",
    "name": "location_id",
    "mode": "nullable",
    "description": "A foreign key to the place of residency for the person in the location table, where the detailed address information is stored."
  },
  {
    "type": "integer",
    "name": "provider_id",
    "mode": "nullable",
    "description": "A foreign key to the primary care provider the person is seeing in the provider table."
  },
  {
    "type": "integer",
    "name": "care_site_id",
    "mode": "nullable",
    "description": "A foreign key to the site of primary care in the care_site table, where the details of the care site are stored."
  },
  {
    "type": "string",
    "name": "person_source_value",
    "mode": "nullable",
    "description": "An (encrypted) key derived from the person identifier in the source data. This is necessary when a use case requires a link back to the person data at the source dataset."
  },
  {
    "type": "string",
    "name": "gender_source_value",
    "mode": "nullable",
    "description": "The source code for the gender of the person as it appears in the source data. The person’s gender is mapped to a standard gender concept in the Standardized Vocabularies; the original value is stored here for reference."
  },
  {
    "type": "integer",
    "name": "gender_source_concept_id",
    "mode": "nullable",
    "description": "A foreign key to the gender concept that refers to the code used in the source."
  },
  {
    "type": "string",
    "name": "race_source_value",
    "mode": "nullable",
    "description": "The source code for the race of the person as it appears in the source data. The person race is mapped to a standard race concept in the Standardized Vocabularies and the original value is stored here for reference."
  },
  {
    "type": "integer",
    "name": "race_source_concept_id",
    "mode": "nullable",
    "description": "A foreign key to the race concept that refers to the code used in the source."
  },
  {
    "type": "string",
    "name": "ethnicity_source_value",
    "mode": "nullable",
    "description": "The source code for the ethnicity of the person as it appears in the source data. The person ethnicity is mapped to a standard ethnicity concept in the Standardized Vocabularies and the original code is, stored here for reference."
  },
  {
    "type": "integer",
    "name": "ethnicity_source_concept_id",
    "mode": "nullable",
    "description": "A foreign key to the ethnicity concept that refers to the code used in the source."
  }
]